{
    "newsdata":[
       {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/adf963b279434cb6f0ac0ba87e2232e8f5b35f3f/phonetap.png",
        "headline":"Today’s news LIVE: Jan 29 | Phone-tapping case: KCR served notice to appear before SIT https://thefederal.com/category/news/india-news-world-sports-business-entertainment-227383?utm_source=chatgpt.com",
        "description":"Hyderabad: The Special Investigation Team (SIT) is likely to issue notices to Bharat Rashtra Samithi (BRS) supremo K Chandrashekar Rao (KCR) and Siddpet MLA T Harish Rao in the ongoing phone-tapping case. \n However, before summoning the leaders, the SIT will re-interrogate P Rajashekar Reddy, who served as Officer on Special Duty (OSD) to KCR during his tenure as chief minister. \n Two other senior officers – Somesh Kumar, who served as Chief Secretary between December 2019 and January 2023, and Naveen Chand, who was State Intelligence Chief from September 2016 to November 2020 – have already been examined. \n The phone tapping case surfaced soon after the Congress government won the 2023 Assembly elections. The case gained prominence after the complainant alleged an SIT constituted during the previous BRS government carried out illegal phone surveillance on political leaders, judges and other prominent individuals, and later destroyed hard disks to erase evidence.",
        "time":"1d ago"
       },
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/9452d9e55851398cadfab46d6022f2e5d27e68ba/elonmusk.jpeg",
        "headline":"Elon Musk Attacks Vinod Khosla After Fellow Billionaire Accused Him Of Racism",
        "description":"Elon Musk, the world's richest man, evoked his partner’s ethnicity and claimed the name of their eldest son—allegedly taken from a scientist of Indian descent—proves he isn’t a racist after fellow billionaire Vinod Khosla lobbed accusations of racism and attempted to poach Musk’s employees. \n Khosla, a venture capitalist in Silicon Valley, recently resurfaced a months-old tweet of Musk’s lamenting the world's falling birth rate, in which Musk specifically claimed, White people are a rapidly diminishing minority of global population \n Khosla responded by saying Musk doesnt want MAGA, he wants WAGA or white America great again’ as a racism [sic] is great and desirable paradigm, then Khosla encouraged any non-white employees of Tesla, SpaceX and X to quit their jobs and work for his venture capital firm instead. \n Musk responded by calling Khosla a pompous a–hole and claiming he's gone full r-tard before Musk evoked the ethnicity of his partner, tech executive Shivon Zilis.“",
        "time":"1d ago"
       },
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/9452d9e55851398cadfab46d6022f2e5d27e68ba/elonmusk.jpeg",
        "headline":"Elon Musk Attacks Vinod Khosla After Fellow Billionaire Accused Him Of Racism",
        "description":"Elon Musk, the world's richest man, evoked his partner’s ethnicity and claimed the name of their eldest son—allegedly taken from a scientist of Indian descent—proves he isn’t a racist after fellow billionaire Vinod Khosla lobbed accusations of racism and attempted to poach Musk’s employees. \n Khosla, a venture capitalist in Silicon Valley, recently resurfaced a months-old tweet of Musk’s lamenting the world's falling birth rate, in which Musk specifically claimed, White people are a rapidly diminishing minority of global population \n Khosla responded by saying Musk doesnt want MAGA, he wants WAGA or white America great again’ as a racism [sic] is great and desirable paradigm, then Khosla encouraged any non-white employees of Tesla, SpaceX and X to quit their jobs and work for his venture capital firm instead. \n Musk responded by calling Khosla a pompous a–hole and claiming he's gone full r-tard before Musk evoked the ethnicity of his partner, tech executive Shivon Zilis.“",
        "time":"1d ago"
       }              

    ]
}