{
    "newsdata":[
       {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/adf963b279434cb6f0ac0ba87e2232e8f5b35f3f/phonetap.png",
        "headline":"Today’s news LIVE: Jan 29 | Phone-tapping case: KCR served notice to appear before SIT https://thefederal.com/category/news/india-news-world-sports-business-entertainment-227383?utm_source=chatgpt.com",
        "description":"Hyderabad: The Special Investigation Team (SIT) is likely to issue notices to Bharat Rashtra Samithi (BRS) supremo K Chandrashekar Rao (KCR) and Siddpet MLA T Harish Rao in the ongoing phone-tapping case. \n However, before summoning the leaders, the SIT will re-interrogate P Rajashekar Reddy, who served as Officer on Special Duty (OSD) to KCR during his tenure as chief minister. \n Two other senior officers – Somesh Kumar, who served as Chief Secretary between December 2019 and January 2023, and Naveen Chand, who was State Intelligence Chief from September 2016 to November 2020 – have already been examined. \n The phone tapping case surfaced soon after the Congress government won the 2023 Assembly elections. The case gained prominence after the complainant alleged an SIT constituted during the previous BRS government carried out illegal phone surveillance on political leaders, judges and other prominent individuals, and later destroyed hard disks to erase evidence.",
        "time":"1d ago"
       },
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/9452d9e55851398cadfab46d6022f2e5d27e68ba/elonmusk.jpeg",
        "headline":"Elon Musk Attacks Vinod Khosla After Fellow Billionaire Accused Him Of Racism",
        "description":"Elon Musk, the world's richest man, evoked his partner’s ethnicity and claimed the name of their eldest son—allegedly taken from a scientist of Indian descent—proves he isn’t a racist after fellow billionaire Vinod Khosla lobbed accusations of racism and attempted to poach Musk’s employees. \n Khosla, a venture capitalist in Silicon Valley, recently resurfaced a months-old tweet of Musk’s lamenting the world's falling birth rate, in which Musk specifically claimed, White people are a rapidly diminishing minority of global population \n Khosla responded by saying Musk doesnt want MAGA, he wants WAGA or white America great again’ as a racism [sic] is great and desirable paradigm, then Khosla encouraged any non-white employees of Tesla, SpaceX and X to quit their jobs and work for his venture capital firm instead. \n Musk responded by calling Khosla a pompous a–hole and claiming he's gone full r-tard before Musk evoked the ethnicity of his partner, tech executive Shivon Zilis.“",
        "time":"1d ago"
       },
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/9452d9e55851398cadfab46d6022f2e5d27e68ba/elonmusk.jpeg",
        "headline":"Elon Musk Attacks Vinod Khosla After Fellow Billionaire Accused Him Of Racism",
        "description":"Elon Musk, the world's richest man, evoked his partner’s ethnicity and claimed the name of their eldest son—allegedly taken from a scientist of Indian descent—proves he isn’t a racist after fellow billionaire Vinod Khosla lobbed accusations of racism and attempted to poach Musk’s employees. \n Khosla, a venture capitalist in Silicon Valley, recently resurfaced a months-old tweet of Musk’s lamenting the world's falling birth rate, in which Musk specifically claimed, White people are a rapidly diminishing minority of global population \n Khosla responded by saying Musk doesnt want MAGA, he wants WAGA or white America great again’ as a racism [sic] is great and desirable paradigm, then Khosla encouraged any non-white employees of Tesla, SpaceX and X to quit their jobs and work for his venture capital firm instead. \n Musk responded by calling Khosla a pompous a–hole and claiming he's gone full r-tard before Musk evoked the ethnicity of his partner, tech executive Shivon Zilis.“",
        "time":"1d ago"
       },
       {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/8ecda4db3e64b5717496d7f1027e63a4002fbcf3/microsoft.jpg",
        "headline":"Microsoft Inks $750 Million Cloud Deal With AI Firm Perplexity",
        "description":"For Microsoft, the Perplexity deal boosts its efforts to position Azure as the place to build AI applications and deploy models from a variety of vendors. \n AI startup Perplexity signed a $750 million deal with Microsoft Corp. to use its Azure cloud service, spreading its business beyond longtime cloud partner Amazon.com Inc.\n The three-year commitment will let Perplexity deploy AI models through Microsoft's Foundry service, including those made by OpenAI, Anthropic and xAI, according to people familiar with the deal, who requested anonymity to discuss a private matter.\n We are excited to partner with Microsoft for access to frontier models from X, OpenAI and Anthropic,a Perplexity spokesperson said.",
        "time":"45min ago"
       }, 
       {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/1fd16f1ec898fac860e67e55f6a07e859a2e5865/republition.png",
        "headline":"Republicans and Democrats reach funding package deal, US president says",
        "description":"US President Donald Trump has said Republicans and Democrats in the Senate have reached an agreement to move forward with parts of a funding package. \n Senate Democrats and Republicans agreed to a package of five spending bills on Thursday, but removed a sixth bill from the package related to funding for the Department of Homeland Security (DHS), the BBC's US partner CBS News reported. \n Funding for DHS will continue at its current amount for two weeks while both sides work out a new deal to fund the agency, CBS News said. \n US President Donald Trump endorsed the deal, and wrote in a post on social media: Hopefully, both Republicans and Democrats will give a very much needed Bipartisan YES Vote. \n The deal approves funding for the defence department, the health department, the treasury, the federal court system and other agencies until the end of the 2026 fiscal year on 30 September.\n In his post Trump added: Republicans and Democrats in Congress have come together to get the vast majority of the Government funded until September, while at the same time providing an extension to the Department of Homeland Security (including the very important Coast Guard, which we are expanding and rebuilding like never before). \n Democrats have been pushing to remove funding for the Department of Homeland Security (DHS) from a $1.2tn (£870bn) federal spending package since a federal agent killed a second US citizen in Minneapolis over the weekend. \n In Minneapolis, an ICE agent shot and killed 37-year-old Renee Good on 7 January, and a Border Patrol officer shot and killed 37-year-old Alex Pretti on 24 January. Both killings, and the ongoing immigration operation in the state, have sparked protests around the country. The second shooting led Democrats, and some Republicans, to push back on approving DHS funding. \n Among the changes to DHS Democrats are seeking are requirements that federal agents obtain warrants before making arrests and clearer rules governing how they identify themselves.",
        "time":"18min ago"
       },
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/96d921b3857fcd3eb0180edbd62b45163910e6dc/chinamove.png",
        "headline":"Why China moved so quickly to execute 11 members of a notorious mafia family",
        "description": "No-one should be surprised that China has swiftly executed the 11 members of a organised crime family from north-eastern Myanmar who were sentenced to death in September. \n China executes more people than anywhere else in the world, according to human rights groups – the exact figure is a state secret. Officials are often executed for corruption. The accusations made against the Ming family were far more serious. \n The Ming, Bau, Wei and Liu clans have dominated the remote border town of Laukkaing in Myanmar's impoverished Shan state, since 2009. \n They rose to power after General Min Aung Hlaing, the current coup leader in Myanmar, led a military operation to drive out the MNDAA, the ethnic insurgent army which had dominated Laukkaing and the area around it since the 1980s. \n The four families, as they became known, took over and began shifting from the old dependence on opium and methamphetamine production to a new economy based on casinos and, eventually, online fraud. \n They remained close to the Myanmar military; in December 2021, after seizing power in his coup, Min Aung Hlaing feted Liu Zhengxiang, patriarch of the Liu clan, in the capital Nay Pyi Taw and awarded him an honorary title for extraordinary contributions to state development. \n His Fully Light conglomerate had lucrative businesses all over Myanmar. Other members of the four families were candidates for the military-backed party the USDP. \n The scam compounds they ran in Laukkaing, though, were brutal, much more so than scam complexes in other parts of Asia. Torture was routine.",
        "time":"2h ago"
       },   
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/6bcff378ed3cc1cad234f46263ab5ca9801e1c10/alcohol.jpeg",
        "headline":"Alcohol, liver cirrhosis, and the point of no return.",
        "description":"There is no set amount of alcohol that is safe for anybody; it is crucial to identify and treat liver disease early while it is still reversible, before it reaches the point of cirrhosis. \n A 40-year-old male with a long history of daily alcohol consumption presented with yellowish discoloration of the eyes and urine, swelling of the lower limbs, and progressive abdominal distention over a short span of 15 days. These symptoms, which were ignored in the early stages (as is common), revealed significant liver damage. Medical testing and imaging showed severe liver disease, revealing how slowly alcohol-related liver damage might proceed. \n In this case, the diagnosis of cirrhosis was confirmed after  scan results from an abdominal ultrasonography that also revealed a substantial buildup of fluid— known as ascitic fluid—in the abdominal cavity. Bilirubin levels were high, well outside the usual maximum limit of 1.2 mg/dL. Put together, these tests showed that this patient’s liver had reached decompensation due to liver cirrhosis, an important point at which the liver can no longer adequately perform all its basic metabolic and detoxifying processes.",
        "time":"9h ago"
       }, 
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/a611f2a8d362e9a10a62e530b5ab72046076b2d0/cages.png",
        "headline":"Cages, crushes and stabbings - is European away safety getting worse?.",
        "description":"Football fans across the country dream of following their club in Europe, seeing them take on the cream of the continent's crop alongside friends and family. \n But European away trips aren't all sunshine, sangria and singalongs - in recent years, there have been a number of significant security incidents in which fans' safety has been put at risk. \n Earlier this season, fans were even barred from attending some away matches in the Champions League amid extremely worrying security trends which some believe are worsening, stripping fans of dignity and in some cases leading to dangerous situations. \n There are definitely countries where the situation is deteriorating, like Germany, Belgium and the Netherlands, said Ronan Evain, executive director of Football Supporters Europe (FSE), which invites travelling fans to fill in a survey about their experience after each round of European fixtures. There are also repeat offenders - countries and clubs where things are not improving and they have demonstrated that they are not capable of hosting games in acceptable conditions.France, Spain, Portugal and Italy are major tourist destinations that are very used to hosting people from all over the world, but clearly treat football fans completely differently - like a threat or second-tier citizen.Security arrangements and policing strategies for European matches are developed via a combination of host clubs, national governments, local authorities and regional police forces, with input from Uefa, who run the competitions.The way fans are treated can vary drastically based on the place they are visiting, the policies of those running the country and/or city, the behaviour of home fans, and the context of the game. Plus, not every fan will have the same experience as others on the same trip.There are some things that are small humiliations - being forced to enter a stadium four hours before kick off, put on a bus for hours with no toilet, having lip balm taken off you, Evain said.",
        "time":"5h ago"
       }, 
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/19de256b7765bf75f88e4414d6d8cc11ee9fcf0a/billioner.png",
        "headline":"Instead Of Bringing Your Family...: Indian-Origin Billionairef On Musk's Abuse",
        "description":"Indian-origin billionaire investor Vinod Khosla advised Musk to not involve his family to defend himself. \n Indian-origin billionaire investor Vinod Khosla has criticised Elon Musk again for “seemingly racist” statements and involving his family to defend himself. “Instead of bringing your family into it, maybe try not tweeting ‘SEEMINGLY' racist stuff next time?” Khosla wrote on X. “Many would appreciate it if you acknowledge you are not trying to establish a white society in America, and are not WAGA. The clash of two billionaires came from a 2025 post by the Tesla CEO, who commented that “white people are a rapidly diminishing minority of the global population.” Reacting to an old post, Khosla accused Musk of making racism “desirable” and supporting WAGA (“White America Great Again”), while Musk fired back by calling Khosla a “pompous a**hole” and a “retard. Musk's defence against allegations of racism included a reference to his half-Indian partner, Shivon Zilis, and their eldest son, named after a Nobel prize-winning Indian-origin astrophysicist. “My partner, Shivon, is half Indian and my eldest son with her is named in honor of the great Indian physicist Chandrasekhar,” he said.",
        "time":"5min ago"
       },   
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/236b0f8139752c0f9b1b9a05a14703f48be3ad90/cardriving.png",
        "headline":"US opens probe after a Waymo self-driving car hit a child near a school",
        "description":"The United States National Highway Traffic Safety Administration (NHTSA) said it is opening an investigation after a Waymo self-driving vehicle struck a child near an elementary school in Santa Monica, California, last week, causing minor injuries and renewing concerns about the safety of robotaxis. \n The car safety agency said on Thursday that the child ran across the street on January 23 from behind a double-parked SUV towards the school and was struck by the Alphabet-unit Waymo autonomous vehicle during normal school drop-off hours. The agency said there were other children, a crossing guard, and several double-parked vehicles in the vicinity. \n The incident comes as robotaxis are being deployed in rising numbers across the country. The US Senate Commerce Committee had already scheduled a hearing on self-driving cars for February 4, which will include Waymo Chief Safety Officer Mauricio Pena. \n The National Transportation Safety Board (NTSB) also said it will investigate the incident. \n Waymo said in a blog post on Thursday that it will cooperate in the investigation and said the child “suddenly entered the roadway from behind a tall SUV, moving directly into our vehicle’s path”. \n It added that the self-driving vehicle immediately detected the individual as soon as the child emerged from behind the stopped vehicle, braking hard and reducing speed from approximately 17 miles per hour (27 kilometres per hour) to under 6mph (10km/h) before contact was made. \n NHTSA is opening a preliminary evaluation to investigate whether the Waymo AV exercised appropriate caution given its proximity to the elementary school during drop-off hours, and the presence of young pedestrians and other potential vulnerable road users.",
        "time":"2d ago"
       },   
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/f934f4588eb6e9225a5ca834149282526d362eb6/nvidea.png",
        "headline":"China conditionally approves DeepSeek to buy Nvidia's H200 chips  - sources",
        "description":"The United States National Highway Traffic Safety Administration (NHTSA) said it is opening an investigation after a Waymo self-driving vehicle struck a child near an elementary school in Santa Monica, California, last week, causing minor injuries and renewing concerns about the safety of robotaxis. \n The car safety agency said on Thursday that the child ran across the street on January 23 from behind a double-parked SUV towards the school and was struck by the Alphabet-unit Waymo autonomous vehicle during normal school drop-off hours. The agency said there were other children, a crossing guard, and several double-parked vehicles in the vicinity. \n The incident comes as robotaxis are being deployed in rising numbers across the country. The US Senate Commerce Committee had already scheduled a hearing on self-driving cars for February 4, which will include Waymo Chief Safety Officer Mauricio Pena. \n The National Transportation Safety Board (NTSB) also said it will investigate the incident. \n Waymo said in a blog post on Thursday that it will cooperate in the investigation and said the child “suddenly entered the roadway from behind a tall SUV, moving directly into our vehicle’s path”. \n It added that the self-driving vehicle immediately detected the individual as soon as the child emerged from behind the stopped vehicle, braking hard and reducing speed from approximately 17 miles per hour (27 kilometres per hour) to under 6mph (10km/h) before contact was made. \n NHTSA is opening a preliminary evaluation to investigate whether the Waymo AV exercised appropriate caution given its proximity to the elementary school during drop-off hours, and the presence of young pedestrians and other potential vulnerable road users.",
        "time":"2d ago"
       },               
      {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/a4b92f4a39f7f55a02e8cac132051b416b56f7f9/health.jpg",
        "headline":"The gadgets set to change your daily health and wellness",
        "description":"The digital health tech industry is booming. And with at-home health monitoring becoming more popular, it's one of the big themes at CES 2026 in Las Vegas. Reporting for BBC Tech Now, Shiona McCallum tests some of the innovations vying for our attention. I’ve been reporting on health and wellness for over a decade and have seen many products, but this was my first CES. If you’re not familiar, CES, which stands for Consumer Electronics Show, is the largest tech conference of the year. Companies come from all over the world to showcase their new products and latest innovations. Many haven’t officially hit the market yet. Located in Las Vegas, the show is huge and is designed like a giant maze that’s hard to escape. (I may have gotten lost a few times.) My job here was to scout health, wellness, fitness, and aging tech. Many of the products at the show were designed to help us collect data on how our bodies function and understand what that data means, so we can take action. Others aim to help us move more, stress less, and sleep better. Women’s health is finally having a moment, and topics like perimenopause and menopause are being more openly discussed. I was excited to see some new tech offerings to help people on their health journey. The data gets sent to an app where you can track your symptoms over time to learn patterns, see if treatments or lifestyle changes are helping, and share information with your healthcare professional.Peri is a one-time purchase with no subscription fee, and the company says it’s made to stay with you throughout perimenopause, which can last 5 to 10 years.[2] The device is now available for preorder via the website for $449, and is expected to ship sometime this year.Petal is the second device I eagerly put up my shirt at CES. At a quick glance, it looks like any bra pad insert. But pressed against the skin are bio-impedance sensors (the same low-voltage electrical current technology used in BMI scales to measure body composition).While you wear Petal, sensors measure your heart health, midsection body composition, and potentially the makeup of your breast tissue. The collected data is sent to an app via Bluetooth, where it can be used to provide information on hormonal cycles and anxiety levels. ",
        "time":"2h ago"
       },   
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/9239fecff80f072b3f882803bce781812c04cfcb/realme.jpg",
        "headline":"Realme P4 Power 5G launched with 10,001 mAh battery in India",
        "description":"The Chinese smartphone maker also introduced Buds Clip earbuds and a cabled 20,000 mAh powerbank. Realme on Thursday (January 29, 2026) launched the P4 Power 5G smartphone in India featuring a 10,001 mAh battery. The Chinese smartphone maker also introduced Buds Clip earbuds with 11mm dual drivers, 3D spatial audio, AI ENC calls, and Gemini-powered voice assistant, priced at ₹5,999, alongside a 45W cabled 20,000 mAh powerbank at ₹2,799. Realme on Thursday (January 29, 2026) launched the P4 Power 5G smartphone in India featuring a 10,001 mAh battery. The Chinese smartphone maker also introduced Buds Clip earbuds with 11mm dual drivers, 3D spatial audio, AI ENC calls, and Gemini-powered voice assistant, priced at ₹5,999, alongside a 45W cabled 20,000 mAh powerbank at ₹2,799. Realme P4 Power is now official in India with the biggest battery you can find on a commercial smartphone. It’s a 10,001mAh Titan Battery promising multi-day usage across gaming, streaming, and browsing social media. Realme seems to have quickly moved from concept to reality as it showcased 10,000mAh and 15,000mAh concept phones last year, and it’s now available for users to purchase. There has been a growing trend in smartphone batteries over the past year, and Realme seems to have taken things too seriously with its latest device.",
        "time":"3d ago"
       },  
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/801c5e91ee0b29a4e8697706218c679105ec60fb/tesla.jpg",
        "headline":"Tesla invests $2 billion in Musk's xAI and reiterates Cybercab production starts this year",
        "description":"Tesla said on Wednesday it will invest $2 billion in CEO Elon Musk’s AI company xAI. The news supported Musk’s plan to pivot Tesla from an electric vehicle maker to an AI company, which is key ‌to the company’s roughly $1.5 trillion valuation, while reassurance of production plans is critical for investor confidence as Tesla has repeatedly fallen short of promises ​made by Musk. But Musk’s plan to build Cybercabs as well as humanoid robots, along with Semi trucks and Roadster sports cars, will mean a series of factory investments that will take capital expenditures above $20 billion this year, Chief Financial Officer Vaibhav Taneja said. That is more than twice the $8.5 billion in 2025. Shares rose about 3.5% in after-hours trading, but pared gains following the capex details to trade up 1.8%. Tesla is “entering a transition phase” where it is asking investors to underwrite potential revenue from self-driving software in its cars and robotaxi business before auto sales recover, said Thomas Monteiro, senior analyst at Investing.com.Musk, who has made a number of inaccurate forecasts about robotaxi rollout, said he expected to have fully autonomous vehicles in a quarter ​to half of the United States by the end of this year. He had said robotaxis would reach half of the U.S. population by the ⁠end of 2025, before later narrowing that goal to deployment in the top eight to 10 metropolitan areas. The company has since missed those targets with a limited robotaxi service in Austin, Texas. Tesla’s core EV business, which still accounts for most of the company’s current revenue, has been under strain as rivals roll out newer models, often at lower prices. A U.S. tax incentive for electric vehicles has also ​ended, and Musk’s far-right political rhetoric has alienated some customers.On Wednesday, Musk ⁠told analysts on a conference call that Tesla would stop selling its Model S sedans and Model X SUVs; flagship vehicles that once established the company as a leader in the EV market but have since dwindled to account for a small fraction of revenue. The factory space will be used to build robots.Tesla’s revenue fell about 3% to roughly $94.83 billion in 2025, marking the company’s first annual decline in revenue.",
        "time":"3d ago"
       },   
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/3fd699a67008e6125cbef7c9e283d36a64489a79/saumsubng.png",
        "headline":"Samsung announces Galaxy F70 series for February",
        "description":"The South Korean electronics major will position the new Galaxy F70 series in the mid segment, and under 30K price bracket. Samsung on Friday (January 30, 2026) announced the launch of Galaxy F70 series in February in India. The new Galaxy F70 series will cater to young and Gen Z buyers.Samsung has officially teased the arrival of its new Galaxy F70 series in India. The company says the upcoming series will combine strong hardware specifications with innovative AI-powered features, aiming to deliver a more ambitious and performance-focused experience than previous F-series models. Notably, the Galaxy F70 series will be the first-ever “70-series” under the Galaxy F branding, marking a new chapter for the portfolio. Samsung’s Galaxy F series has largely been positioned in the budget and midrange segments, focusing on value-driven smartphones with big batteries, AMOLED displays, and competitive pricing. With the F70 series, Samsung appears to be continuing with that strategy.According to Samsung, the Galaxy F70 series will cater to the mid and affordable segment, priced under Rs 30,000. The first smartphone in the series is confirmed to launch in February and will debut in the Rs 10,000–15,000 price bracket, setting the tone for what the F70 lineup represents. More phones from the lineup are expected to launch eventually, and at different price brackets. The Galaxy F-series microsite has gone live on Flipkart and the Samsung India website. The teaser image has February 2nd listed as the revealing date. It’s not confirmed if this is the launch date for the first Galaxy F70 series phone or an announcement about the new lineup. The teaser image has a glimpse of the camera sensor, suggesting the Galaxy F70 series will focus on photography.The company has highlighted that the Galaxy F70 series will focus on a mix of powerful hardware and AI-driven features, with an emphasis on helping users “stand out” and keep pace with modern usage demands. While Samsung has not revealed specific specifications yet, the reference to AI features hints at smarter camera tools, enhanced performance optimisation, and user-centric software capabilities. These are areas where Samsung is already a pioneer and has been steadily expanding its AI push across recent Galaxy launches.",
        "time":"17h ago"
       },   
         {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/0b1da751a418128530a4c17f88e8d2fb2c318c4c/trumpuk.jpeg",
        "headline":"Trump warns U.K. about business with China after Starmer-Xi talks",
        "description":"Mr. Starmer said Britain would not have to choose between closer ties with the United States or China, highlighting Mr. Trump’s ⁠visit to Britain in September. U.S. President Donald Trump has warned ​the United Kingdom against getting into business with China ‌after British Prime Minister Keir Starmer and Chinese ​leader Xi Jinping hailed a reset in relations.With Western leaders reeling from the unpredictability of Mr. Trump, Mr. Starmer became the latest to head to China, where he called for a more sophisticated relationship with improved market access, lower tariffs and investment deals in three-hours of talks with Mr. Xi on Thursday (January 29, 2026).During the premiere of ​the Melania film at the Kennedy Centre, Mr. Trump was asked about ⁠the U.K. pledging greater business cooperation with China, and he told reporters: Mr. Starmer, whose centre-left Labour government has struggled to deliver the economic growth it promised, has made improving relations with the world's second-largest economy a priority.Well, it's very dangerous for them to do that, and it's even more dangerous ​I think for Canada to ⁠get into business with China. His visit ‌comes amid Mr. Trump's on-off threats of trade tariffs and ‌pledges to grab control of Greenland, an autonomous territory of Denmark, which have rattled long-standing U.S. allies, such ‍as Britain.Mr. Starmer told reporters on the plane on the way to China that Britain could continue to strengthen economic ties with ‍China — without angering Mr. Trump — because of his country's long history of working closely with the United States.",
        "time":"12d ago"
       },   
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/722fba8442f605a5ec0be71db1be3729a0e38c0f/supremecourt.jpeg",
        "headline":"Supreme Court tells Election Commission to display list of names left out of Tamil Nadu rolls with reasons",
        "description":"These voters have 10 days to submit documents for verification after list display; on January 28, DMK had complained that 1.2 crore excluded voters had not got hearing notices, with SIR objections ending on January 30.The Supreme Court on Thursday (January 29, 2026) directed the Election Commission of India (ECI) to publicly display the list of names excluded from Tamil Nadu’s draft electoral roll due to ‘logical discrepancies’ as part of its Special Intensive Revision (SIR) exercise.The Supreme Court on Thursday directed the Election Commission to publish the names of about 1.6 crore persons against whom the poll panel had raised “logical discrepancy” objections during the special intensive revision exercise in Tamil Nadu, The Hindu reported.A bench of Chief Justice of India Surya Kant and Justice Joymalya Bagchi directed that the list be posted in taluk offices across the state. The court added that those whose names are on the list will have 10 days from the date of its display to submit their documents for verification.The bench added that the list should also briefly mention against each name the “logical discrepancy” that the poll panel had found in their forms.“Logical discrepancies” that the Election Commission has flagged during the special intensive revision process include mismatches in parents’ names, low age gap with parents and the number of children of the parents being above six.The draft electoral rolls for Tamil Nadu under the special intensive revision exercise were published on December 19. The names of 97.3 lakh persons were removed from the draft voter lists in the state.The court on Thursday was hearing a petition filed by a group of Dravida Munnetra Kazhagam leaders, The Hindu reported. The petition had noted that the period to file claims and objections during the revision exercise in the state was ending on January 30.",
        "time":"2d ago"
       },   
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/2ccfa1925f7741586c32c7375b8ef244eeaea7d6/apple.png",
        "headline":"CNBC Daily Open: iPhone drove Apple’s robust earnings — but investors weren’t too enthused",
        "description":"One of the defining features of Apple’s iPhone 17 Pro is its 8x zoom — it helps focus on things that matter. For consumers, it’s memorable moments; for Apple, it’s the balance sheet. On Thursday stateside, the Cupertino-based company reported a 16% year-on-year jump in its fiscal first-quarter revenue on “staggering” iPhone demand, topping market estimates. It also forecast current-quarter revenue above Wall Street expectations.Investor response, however, was tepid, with Apple shares rising about 0.5% in extended trading. That could be because Apple still appears behind the curve for artificial intelligence.But investors drove Meta Platform shares more than 10% higher, after the company showed signs that its AI investments were boosting its bottom line. Markets, however, saw a bright spot in gold, which rebounded after experiencing a dip during midday U.S. hours as traders took profit — the precious metal had hit $5,626.8 earlier in the day, its highest level ever.In the White House, Trump on Thursday said he would announce on Friday morning stateside a new Federal Reserve chair to replace Jerome Powell. Trump also endorsed a Senate deal on government funding that would help avert a shutdown of federal services, according to Reuters. ",
        "time":"14h ago"
       },  
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/e9721ef8a7fa2523b1f8b2bd114d7cfbad0f2e3f/CNBC.jpg",
        "headline":"The “gross” idea that built a baby product empire",
        "description":"The CNBC Changemakers and Power Players podcast features candid conversations with leaders shaping business and culture. In this episode, CNBC’s Julia Boorstin sits down with Chelsea Hirschhorn, founder and CEO of Frida — the company behind one of parenting’s most talked-about products. \n That product is the NoseFrida, often called the “snot sucker.” It’s a simple tool that helps parents clear a baby’s stuffy nose using gentle suction and a built-in filter. Hirschhorn shares how a simple gift from another mom sparked her leap from law to entrepreneurship — and how she grew Frida from a small startup into a 150-product brand spanning baby care, postpartum recovery, fertility, and women’s health. She also opens up about how trusting her intuition, embracing discomfort, and building without venture capital became her leadership edge.",
        "time":"24h ago"
       }, 
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/32bf1e43c02ea50f244f960183678d585205c073/mettta.jpg",
        "headline":"Meta, Google and other tech giants go to trial over child safety after TikTok and Snap settle",
        "description":"Jury selection has officially begun in a high-profile lawsuit against the world’s biggest social media companies. While TikTok and Snap have recently settled, Meta and Google’s YouTube are heading to court to defend their product designs against claims that they knowingly fueled a youth mental health crisis. With top CEOs like Mark Zuckerberg expected to testify, the outcome could set a massive precedent for the future of Big Tech. Meta Platforms is set to face trial next week in a lawsuit brought by the state of New Mexico accusing it of exposing children and teens to sexual exploitation ‍on its platforms and profiting from it, the first case of its kind against the social media giant to reach a jury.Read more at: https://economictimes.indiatimes.com/tech/technology/meta-faces-new-mexico-trial-over-child-exploitation-claims/articleshow/127799438.cms?from=mdr&utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst",
        "time":"1d ago"
       },  
        {
        "image":"https://raw.githubusercontent.com/MPSOLTECHNO/newsImages/3718432f681ee2e4578b643d28379b86e3e9d446/gold.png",
        "headline":"Gold surges past $5,500 amid Iran tensions, weakening US dollar",
        "description":"Precious metal hits fresh record as US President Donald Trump renews threats against Iran.Gold prices have set a new record amid United States President Donald Trump’s threats of military action against Iran and the weakness of the US dollar. Bullion surged past $5,500 an ounce on Thursday, extending an extraordinary rally that has seen the precious metal gain more than 20 percent in value since the start of the year. The latest peak came after Trump said a “massive Armada” was on its way to Iran and that US forces were prepared to act with “speed and violence, if necessary”.Gold has been historically prized by investors for its tendency to hold its value, particularly during periods of economic uncertainty or upheaval.The precious metal soared 64 percent in 2025, a year marked by Trump’s return to the White House and his radical shake-up of international trade and institutions.The metal’s stellar run has also been aided by the declining popularity of other traditional “safe haven” assets such as government bonds, whose lustre has dimmed amid anxiety about the massive debt held by advanced economies, including the US.Asian stock markets opened mostly lower on Thursday, before rebounding in the afternoon. Japan’s Nikkei 225 was up about 0.2 percent as of 2:30pm local time.Hong Kong’s Hang Seng Index was about .07 percent higher, while the SSE Composite Index in Shanghai was up about 0.1 percent.",
        "time":"1d ago"
       }         
    ]
}
